#### ElementNode Members

---

|  |
| --- |
| ElementNode Class   Methods   Properties   See Also |

The  ElementNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | Gets the document associated with the element. |
| Public property | ElementId | The Id of the element. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | LinkInstanceId | The Id of the link instance for the element. |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |

# See Also

ElementNode Class

Autodesk.Revit.DB Namespace